Revit 2026 API

# RebarUpdateCurvesData Properties

---

The RebarUpdateCurvesData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AlignedFreeFormSetOrientationOptions | Orientation options for an Aligned Free Form Rebar set. |
|  | AreOrientationOptionsChanged | Indicates if the orientation options have changed since the last regeneration. |
|  | AreWorkshopInstructionsChanged | Indicates if the workshop instructions have changed since the last regeneration. |
|  | CycleCounterChanged | True if the cycle counter was changed, false otherwise.The cycle counter value is changed when the free form Rebar element is selected and the user press Space key -or- by through [!:Autodesk::Revit::DB::Structure::RebarRebarFreeFormAccessor::CycleCounter] property. -or- by the server if it considers that the counter reaches the maximum value and reset it (set it to 0). |
|  | ErrorMessage | The reason for calculation failure. If the calculation fails, this message will be shown in an error, or warning if we are editing the constraints. |
|  | HostMirrored | If true, then host of the rebar was mirrorred (along with the rebar) before this regeneration. |
|  | IsAttachmentTypeChanged | Indicates if the attachment type has changed since the last regeneration. |
|  | IsBarsNumberChanged | Indicates if the bar number has changed since the last regeneration. |
|  | IsBendingRadiusChanged | Indicates if the bending radius has changed since the last regeneration. |
|  | IsEndConstraintChanged | Indicates if the end handle constraint has changed since the last regeneration. |
|  | IsLayoutChanged | Indicates if the layout has changed since the last regeneration. |
|  | IsReversed | Used to store the state of the bar refering to the direction of the bars. This is useful when using face intersection to calculate bars. After mirroring, curves created from intersecting faces may be reversed, so we use this to store the state and keep the rebar pointing in the correct direction. |
|  | IsSpacingChanged | Indicates if the spacing has changed since the last regeneration. |
|  | IsStartConstraintChanged | Indicates if the start handle constraint has changed since the last regeneration. |
|  | IsStyleChanged | Indicates if the style has changed since the last regeneration. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Spacing | The spacing between the bars, according to the LayoutRule. |
|  | WorkshopInstructions | Identifies the workshop instructions of this rebar. |

#### Reference

RebarUpdateCurvesData Class

Autodesk.Revit.DB.Structure Namespace